
Super Duper Config
-----------------
* Packages
   #+BEGIN_SRC emacs-lisp

       (require 'package)
       (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
       ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
       ;; and `package-pinned-packages`. Most users will not need or want to do this.
       ;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
       (package-initialize)
       ;;(package-refresh-contents)

    ;; Download Evil
    (unless (package-installed-p 'evil)
    (package-install 'evil ))
    (package-install 'use-package)
    (package-install 'mood-line)
    (package-install 'counsel)
    (package-install 'command-log-mode)
    (package-install 'spaceline)
    (package-install 'beacon)
    (package-install 'doom-modeline)
    (package-install 'spaceline-all-the-icons)
    (package-install 'ivy)
    (package-install 'swiper)
    (package-install 'smart-mode-line)
    (package-install 'powerline)
    (package-install 'org)
    (package-install 'ido)
    (package-install 'tuareg)
    (package-install 'projectile)
    (package-install 'company)
    (package-install 'org-bullets)
    (package-install 'org-superstar)
    (package-install 'evil)
    (package-install 'evil-org)
    (package-install 'smartparens)
    (package-install 'evil-commentary)
    (package-install 'evil-collection)
    (package-install 'fzf)
    (package-install 'merlin)
    (package-install 'auto-complete)
    (package-install 'windresize)
    (package-install 'eval-in-repl)
    (package-install 'ivy-posframe)
    (package-install 'ivy-rich)
    (package-install 'ivy-prescient)

   #+END_SRC

   #+RESULTS:
   : ‘all-the-icons’ is already installed

** Expand to full screen on startup
   #+BEGIN_SRC emacs-lisp
     ;; start the initial frame maximized
     ;; (add-to-list 'initial-frame-alist '(fullscreen . maximized))
   #+END_SRC

   #+RESULTS:
   : ((fullscreen . maximized))

** Exec Paths
   #+begin_src emacs-lisp
     ;; (add-to-list 'exec-path "/usr/local/bin")
     ;; (add-to-list 'exec-path "/home/k8s/.fzf/bin")
     ;; (add-to-list 'exec-path "/usr/bin")
      (setq exec-path (append exec-path '("/home/k8s/.fzf/bin")))
      (setenv "PATH" (concat (getenv "PATH") ":/home/k8s/.fzf/bin"))

   #+end_src

   #+RESULTS:
   : /home/k8s/.local/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/home/k8s/.fzf/bin

 Smart Paren
  #+begin_src emacs-lisp
    ;;(require 'smartparens-config)
    ;; Always start smartparens mode in js-mode.
    ;;(add-hook 'emacs-lisp-mode-hook #'smartparens-mode)
    ;;(sp-local-pair 'org-mode "\\[" "\\]")
    ;;(sp-local-pair 'org-mode "$" "$")
    ;;(sp-local-pair 'org-mode "'" "'" :actions '(rem))
    ;;(sp-local-pair 'org-mode "=" "=" :actions '(rem))
    ;;(sp-local-pair 'org-mode "\\left(" "\\right)" :trigger "\\l(" :post-handlers '(sp-latex-insert-spaces-inside-pair))
    ;;(sp-local-pair 'org-mode "\\left[" "\\right]" :trigger "\\l[" :post-handlers '(sp-latex-insert-spaces-inside-pair))
    ;;(sp-local-pair 'org-mode "\\left\\{" "\\right\\}" :trigger "\\l{" :post-handlers '(sp-latex-insert-spaces-inside-pair))
    ;(sp-local-pair 'org-mode "\\left|" "\\right|" :trigger "\\l|" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  #+end_src


** ivy prescient 
   #+begin_src emacs-lisp

(use-package prescient
  :ensure t
  :config
  (setq prescient-history-length 200)
  (setq prescient-save-file "~/.emacs.d/prescient-items")
  (setq prescient-filter-method '(literal regexp))
  (prescient-persist-mode 1))

(use-package ivy-prescient
  :ensure t
  :after (prescient ivy)
  :config
  (setq ivy-prescient-sort-commands
        '(:not counsel-grep
               counsel-rg
               counsel-switch-buffer
               ivy-switch-buffer
               swiper
               swiper-multi))
  (setq ivy-prescient-retain-classic-highlighting t)
  (setq ivy-prescient-enable-filtering nil)
  (setq ivy-prescient-enable-sorting t)
  (ivy-prescient-mode 1))

   #+end_src

   #+RESULTS:
   | ivy-rich-mode | ivy-posframe-mode | global-company-mode | package--save-selected-packages | x-wm-set-size-hint | tramp-register-archive-file-name-handler |

** ivy rich
   #+begin_src emacs-lisp

    (use-package ivy-rich
    :ensure t
    :config
    (setq ivy-rich-path-style 'abbreviate)
    (setcdr (assq t ivy-format-functions-alist)
	    #'ivy-format-function-line)
    :hook (after-init . ivy-rich-mode))


   #+end_src

   #+RESULTS:
   | ivy-rich-mode | ivy-posframe-mode | global-company-mode | package--save-selected-packages | x-wm-set-size-hint | tramp-register-archive-file-name-handler |

